Repository: abhinavm24/typewhisper-mac
Catalog: TypeWhisperPluginSDK/Plugins/OpenAIPlugin/Localizable.xcstrings
Source language: en
Languages: de, ja, zh_hans

source: Voice instructions
de: Anweisungen für die Stimme
ja: 読み上げ方の指示
zh_hans: 语音生成指令

source: Temperature Mode
de: Temperaturmodus
ja: 温度モード
zh_hans: 温度模式

source: ChatGPT login uses the supported ChatGPT/Codex model list. Use API Key mode for the full OpenAI API catalog.
de: Die ChatGPT-Anmeldung verwendet die unterstützte ChatGPT-/Codex-Modellliste. Verwende den API-Schlüssel-Modus für den vollständigen OpenAI-API-Katalog.
ja: ChatGPTログインでは、対応するChatGPT/Codexモデルの一覧を使用します。OpenAI APIの全モデルを使用するには、APIキーモードを選んでください。
zh_hans: ChatGPT 登录使用受支持的 ChatGPT/Codex 模型列表。如需完整的 OpenAI API 模型目录，请使用 API 密钥模式。

source: Could not refresh models. Keeping the current list.
de: Modelle konnten nicht aktualisiert werden. Die aktuelle Liste bleibt erhalten.
ja: モデルを更新できませんでした。現在の一覧を保持します。
zh_hans: 无法刷新模型，将保留当前列表。

source: Custom
de: Benutzerdefiniert
ja: カスタム
zh_hans: 自定义

source: Custom temperature is ignored for the selected GPT-5 reasoning configuration.
de: Die benutzerdefinierte Temperatur wird für die gewählte GPT-5-Denkkonfiguration ignoriert.
ja: 選択したGPT-5の推論設定では、カスタム温度は無視されます。
zh_hans: 所选的 GPT-5 推理配置不使用自定义温度。

source: Provider Default
de: Anbieterstandard
ja: プロバイダーのデフォルト
zh_hans: 提供商默认

source: Refreshing
de: Wird aktualisiert
ja: 更新中
zh_hans: 正在刷新

source: Refreshing OpenAI models...
de: OpenAI-Modelle werden aktualisiert …
ja: OpenAIモデルを更新中...
zh_hans: 正在刷新 OpenAI 模型…

source: Temperature
de: Temperatur
ja: 温度
zh_hans: 温度

source: Text-to-Speech Voice
de: Stimme für die Sprachausgabe
ja: 読み上げ音声
zh_hans: 语音合成音色

source: Updated ChatGPT/Codex model list.
de: ChatGPT-/Codex-Modellliste aktualisiert.
ja: ChatGPT/Codexモデルの一覧を更新しました。
zh_hans: 已更新 ChatGPT/Codex 模型列表。

source: Use your existing ChatGPT Plus/Pro or Codex login for prompt processing. Transcription and text-to-speech still require an API key.
de: Verwende deine bestehende ChatGPT-Plus-/Pro- oder Codex-Anmeldung für die Prompt-Verarbeitung. Transkription und Sprachausgabe benötigen weiterhin einen API-Schlüssel.
ja: 既存のChatGPT Plus/ProまたはCodexのログインでプロンプト処理を利用できます。文字起こしと読み上げには引き続きAPIキーが必要です。
zh_hans: 使用现有的 ChatGPT Plus/Pro 或 Codex 登录来处理提示词。转录和语音合成功能仍需要 API 密钥。

source: API Key
de: API-Schlüssel
ja: APIキー
zh_hans: API 密钥

source: API keys are stored securely in the Keychain
de: API-Schlüssel werden sicher im Schlüsselbund gespeichert
ja: APIキーはキーチェーンに安全に保存されます
zh_hans: API 密钥安全存储在钥匙串中

source: Advanced
de: Erweitert
ja: 詳細
zh_hans: 高级

source: ChatGPT login connected
de: ChatGPT-Login verbunden
ja: ChatGPTログインが接続済み
zh_hans: ChatGPT 登录已连接

source: ChatGPT login connected.
de: ChatGPT-Login verbunden.
ja: ChatGPTログインが接続済み。
zh_hans: ChatGPT 登录已连接。

source: ChatGPT login exposes only the supported ChatGPT/Codex models.
de: Der ChatGPT-Login zeigt nur die unterstützten ChatGPT-/Codex-Modelle an.
ja: ChatGPTログインはサポートされているChatGPT/Codexモデルのみを表示します。
zh_hans: ChatGPT 登录仅显示支持的 ChatGPT/Codex 模型。

source: Complete the OpenAI login in your browser. TypeWhisper will finish the connection automatically.
de: Schliessen Sie den OpenAI-Login im Browser ab. TypeWhisper verbindet den Account danach automatisch.
ja: ブラウザでOpenAIログインを完了してください。TypeWhisperはその後自動でアカウントを接続します。
zh_hans: 在浏览器中完成 OpenAI 登录。TypeWhisper 会自动完成连接。

source: Connected plan: %@
de: Verbundener Plan: %@
ja: 接続済みプラン: %@
zh_hans: 已连接套餐：%@

source: Connection Method
de: Verbindungsmethode
ja: 接続方法
zh_hans: 连接方式

source: Describe the recording topic, setting, or relevant context.
de: Beschreiben Sie Thema, Umgebung oder relevanten Kontext der Aufnahme.
ja: 録音のトピック、状況、または関連するコンテキストを説明します。
zh_hans: 描述录音主题、环境或相关上下文。

source: GPT-4o models do not support Whisper Translate (translation to English).
de: GPT-4o-Modelle unterstützen Whisper Translate (Übersetzung ins Englische) nicht.
ja: GPT-4oモデルはWhisper Translate（英語への翻訳）をサポートしていません。
zh_hans: GPT-4o 模型不支持 Whisper 翻译（翻译为英语）。

source: Language hints and dictionary terms are added automatically.
de: Sprachhinweise und Wörterbucheinträge werden automatisch ergänzt.
ja: 言語ヒントと辞書用語は自動的に追加されます。
zh_hans: 语言提示和词典术语会自动添加。

source: Live Transcription Delay
de: Verzögerung der Live-Transkription
ja: ライブ文字起こしの遅延
zh_hans: 实时转录延迟

source: Lower delay shows partial text sooner; higher delay gives the model more audio context.
de: Eine niedrigere Verzögerung zeigt Teiltext früher; eine höhere gibt dem Modell mehr Audiokontext.
ja: 遅延を低くすると部分テキストが早く表示され、高くするとモデルがより多くの音声コンテキストを利用できます。
zh_hans: 较低的延迟会更快显示部分文本；较高的延迟为模型提供更多音频上下文。

source: None
de: Keine
ja: なし
zh_hans: 无

source: Realtime transcription streams 24 kHz PCM through OpenAI's Realtime API.
de: Die Echtzeittranskription streamt 24-kHz-PCM über die Realtime API von OpenAI.
ja: リアルタイム文字起こしは、OpenAIのRealtime APIを通じて24 kHz PCMをストリーミングします。
zh_hans: 实时转录通过 OpenAI Realtime API 流式传输 24 kHz PCM 音频。

source: Transcription Context
de: Transkriptionskontext
ja: 文字起こしコンテキスト
zh_hans: 转录上下文

source: Translate requires Whisper 1.
de: Für Übersetzungen ist Whisper 1 erforderlich.
ja: 翻訳にはWhisper 1が必要です。
zh_hans: 翻译需要 Whisper 1。

source: X High
de: Sehr hoch
ja: 最高
zh_hans: 最高

source: Imported your existing Codex login.
de: Bestehender Codex-Login importiert.
ja: 既存のCodexログインがインポートされました。
zh_hans: 已导入您现有的 Codex 登录。

source: Import Codex Login
de: Codex-Login importieren
ja: Codexログインをインポート
zh_hans: 导入 Codex 登录

source: Invalid API Key
de: Ungültiger API-Schlüssel
ja: 無効なAPIキー
zh_hans: 无效的 API 密钥

source: LLM Model
de: LLM-Modell
ja: LLMモデル
zh_hans: LLM 模型

source: Controls how much thinking time the model spends before answering.
de: Steuert, wie viel Denkzeit sich das Modell vor der Antwort nimmt.
ja: モデルが回答前にどのくらい考える時間を取るかを制御します。
zh_hans: 控制模型在回答前花费多少思考时间。

source: High
de: Hoch
ja: 高
zh_hans: 高

source: Low
de: Niedrig
ja: 低
zh_hans: 低

source: Medium
de: Mittel
ja: 中
zh_hans: 中

source: Refresh
de: Aktualisieren
ja: 更新
zh_hans: 刷新

source: Remove
de: Entfernen
ja: 削除
zh_hans: 移除

source: Reasoning Effort
de: Denkaufwand
ja: 思考負荷
zh_hans: 推理力度

source: Save
de: Sichern
ja: 保存
zh_hans: 保存

source: Sign In In Browser
de: Im Browser anmelden
ja: ブラウザでログイン
zh_hans: 在浏览器中登录

source: Transcription Model
de: Transkriptionsmodell
ja: 音声認識モデル
zh_hans: 转录模型

source: Use your existing ChatGPT Plus/Pro or Codex login for prompt processing. Transcription still requires an API key.
de: Nutzen Sie Ihren bestehenden ChatGPT-Plus-/Pro- oder Codex-Login für Prompt-Verarbeitung. Für Transkription ist weiterhin ein API-Schlüssel nötig.
ja: 既存のChatGPT Plus/ProまたはCodexログインを使用してプロンプト処理を行います。音声認識には引き続きAPIキーが必要です。
zh_hans: 使用您现有的 ChatGPT Plus/Pro 或 Codex 登录来处理提示词。转录仍需 API 密钥。

source: Using default models. Press Refresh to fetch all available models.
de: Standardmodelle werden verwendet. Klicken Sie auf Aktualisieren, um alle verfügbaren Modelle abzurufen.
ja: 標準モデルが使用されます。更新をクリックして利用可能なすべてのモデルを取得してください。
zh_hans: 正在使用默认模型。点击刷新以获取所有可用模型。

source: Valid API Key
de: Gültiger API-Schlüssel
ja: 有効なAPIキー
zh_hans: 有效的 API 密钥

source: Validating...
de: Wird überprüft ...
ja: 確認中...
zh_hans: 验证中...

source: Waiting for OpenAI login...
de: Warte auf OpenAI-Login ...
ja: OpenAIログインを待機中...
zh_hans: 正在等待 OpenAI 登录...

source: ChatGPT Login
ja: ChatGPTログイン
zh_hans: ChatGPT 登录

source: Minimal
ja: 最小
zh_hans: 最小

source: Maximum
ja: 最大
zh_hans: 最大
